app/controllers/rides_controller.rb

  def index
    @rides = Ride.all
---
SELECT "rides".* FROM "rides"

  def show
    @ride = Ride.find(params[:id])
---
SELECT "rides".* FROM "rides" WHERE "rides"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
    @ride = Ride.find(params[:id])
---
SELECT "rides".* FROM "rides" WHERE "rides"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @ride = current_user.rides.build(params[:ride])

    respond_to do |format|
      if @ride.save
        @ride.locations.create(:address => params[:ride][:source], :location_type => "source")
---
INSERT INTO "rides" ("created_at", "depart_date", "destination", "preferences", "return_date", "source", "updated_at", "user_id", "who") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "locations" ("address", "created_at", "latitude", "location_type", "longitude", "ride_id", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    @ride = Ride.find(params[:id])

    respond_to do |format|
      if @ride.update_attributes(params[:ride])
---
SELECT "rides".* FROM "rides" WHERE "rides"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "rides" SET "from" = 'Banashankari', "to" = 'Koramangala', "updated_at" = '2012-10-01 15:48:03.811110' WHERE "rides"."id" = 1

  def destroy
    @ride = Ride.find(params[:id])
    @ride.destroy
---
SELECT "rides".* FROM "rides" WHERE "rides"."id" = ? LIMIT 1  [["id", "9"]]
DELETE FROM "rides" WHERE "rides"."id" = ?  [["id", 9]]

  def search
    @search = Ride.search(params[:search])
---
SELECT "rides".* FROM "rides"

  def search_rides
    params[:search].delete_if {|k, v| v.empty?}
    @search = Ride.search(params[:search])
---
SELECT "rides".* FROM "rides" WHERE ("rides.from" = 'Banashankari')