app/views/rides/show.html.erb


<% source = @ride.locations.where(:location_type => 'source').first%>
---
SELECT "locations".* FROM "locations" WHERE "locations"."ride_id" = 21 AND "locations"."location_type" = 'source' LIMIT 1